day = input("Введіть назву дня: ")


match day.capitalize():
    case "Понеділок":
        print("Сьогодні робочий день!")
    case "Вівторок":
        print("Сьогодні робочий день!")
    case "Середа":
        print("Сьогодні робочий день!")
    case "Четвер":
        print("Сьогодні робочий день!")
    case "П'ятниця":
        print("Сьогодні робочий день!")
    case "Субота":
        print("Сьогодні вихідний!")
    case "Неділя":
        print("Сьогодні вихідний!")
    case _:
        print("Такого дня не існує!")